In [17]:
import pandas as pd
import numpy as np
import re
import uuid

In [18]:
fb_dataset_path = '../data/fb.json'
olx_dataset_path = '../data/olx_remote_work.json'
o24_dataset_path = '../data/oglaszamy24.json'
jh_dataset_path = '../data/jobhunter_cleaned.json'
jhg_dataset_path = '../data/jobhunter_generated.csv'

In [19]:
df_fb = pd.read_json(fb_dataset_path)
df_olx = pd.read_json(olx_dataset_path)
df_o24 = pd.read_json(o24_dataset_path)
df_jh = pd.read_json(jh_dataset_path)
df_jhg = pd.read_csv(jhg_dataset_path).drop(columns=['cluster'])

In [20]:
df_fb.head()

                 id                                               text
0  1357999284721525  ‼️‼️4.000 - 6.000 zł za spisanie i zamknięcie ...
1  1512648315923287  WARSZAWA!\n\nPotrzebuję hostessy lub hosta! 🙂\...
2  1512730425915076  PRACA OD JUTRA\nZatrudnię pełnoletnie osoby do...
3  1512510969270355  W związku z dynamicznie rozwijającym się Zespo...
4  1505264493328336  Przy komputerze\nUmowa, wynagrodzenie co miesi...

In [21]:
df_fb['id'] = df_fb['id'].astype(str)

In [22]:
df_olx.head()

,id,text
0,http://www.olx.pl/oferta/praca/praca-zdalna-40...,"Nie, to nie pomyłka! Nie musisz dalej szukać, ..."
1,http://www.olx.pl/oferta/praca/praca-w-domu-dl...,W związku z prężnie rozwijającym się projektem...
2,http://www.olx.pl/oferta/praca/ankieter-zdalny...,Poszukujemy osoby do pracy zdalnej na stanowis...
3,http://www.olx.pl/oferta/praca/praca-handlowie...,Wynagrodzenie: 5-7 tys. zł.Umowa o pracęGodz. ...
4,http://www.olx.pl/oferta/praca/prowadzacy-kolk...,Jesteś studentem kierunków informatycznych lub...

In [23]:
df_o24.head()

,id,text
0,http://krakow.oglaszamy24.pl/ogloszenie/154952...,"Witam, tak jak w tytule poszukuję kobiete do s..."
1,http://opole.oglaszamy24.pl/ogloszenie/1885440...,"Chcesz zbudować, odnowić, przywrócić lub po pr..."
2,http://warszawa.oglaszamy24.pl/ogloszenie/1017...,"Medycyna pracy od ręki ,badania wysokościowe,\..."
3,http://lodz.oglaszamy24.pl/ogloszenie/49325871...,"Medycyna pracy od ręki ,badania wysokościowe,\..."
4,http://katowice.oglaszamy24.pl/ogloszenie/1330...,"Medycyna pracy od ręki ,badania wysokościowe,\..."

In [24]:
df_jh.head()

                                                text  label
0  Poszukujemy osoby do obsługi klienta, która bę...      0
1  Poszukujemy Specjalisty ds. Obsługi Klienta, k...      0
2  Stanowisko: Specjalista ds. Obsługi Klienta  -...      0
3  Stanowisko: Specjalista ds. Obsługi Klienta  -...      0
4  Stanowisko: Specjalista ds. Obsługi Klienta  -...      0

In [25]:
uuids = [str(uuid.uuid4()) for _ in range(len(df_jh))]
df_jh['id'] = uuids

In [26]:
df_jhg.head()

                                                text  label
0  Specjalista ds. Obsługi Klienta i Sprzedaży Pr...      1
1  Samodzielna Księgowa  Twój zakres obowiązków: ...      1
2  Specjalista ds. Obsługi Klienta  Twój zakres o...      1
3  Asystent ds. Marketingu   Twój zakres obowiązk...      1
4  Specjalista ds. Sprzedaży  Twój zakres obowiąz...      1

In [27]:
uuids = [str(uuid.uuid4()) for _ in range(len(df_jhg))]
df_jhg['id'] = uuids

In [29]:
df_fb['label'] = np.nan
df_olx['label'] = np.nan
df_o24['label'] = np.nan

In [30]:
df_fb.head()

                 id                                               text  label
0  1357999284721525  ‼️‼️4.000 - 6.000 zł za spisanie i zamknięcie ...    NaN
1  1512648315923287  WARSZAWA!\n\nPotrzebuję hostessy lub hosta! 🙂\...    NaN
2  1512730425915076  PRACA OD JUTRA\nZatrudnię pełnoletnie osoby do...    NaN
3  1512510969270355  W związku z dynamicznie rozwijającym się Zespo...    NaN
4  1505264493328336  Przy komputerze\nUmowa, wynagrodzenie co miesi...    NaN

In [31]:
df_olx.head()

,id,text,label
0,http://www.olx.pl/oferta/praca/praca-zdalna-40...,"Nie, to nie pomyłka! Nie musisz dalej szukać, ...",NaN
1,http://www.olx.pl/oferta/praca/praca-w-domu-dl...,W związku z prężnie rozwijającym się projektem...,NaN
2,http://www.olx.pl/oferta/praca/ankieter-zdalny...,Poszukujemy osoby do pracy zdalnej na stanowis...,NaN
3,http://www.olx.pl/oferta/praca/praca-handlowie...,Wynagrodzenie: 5-7 tys. zł.Umowa o pracęGodz. ...,NaN
4,http://www.olx.pl/oferta/praca/prowadzacy-kolk...,Jesteś studentem kierunków informatycznych lub...,NaN

In [32]:
df_o24.head()

,id,text,label
0,http://krakow.oglaszamy24.pl/ogloszenie/154952...,"Witam, tak jak w tytule poszukuję kobiete do s...",NaN
1,http://opole.oglaszamy24.pl/ogloszenie/1885440...,"Chcesz zbudować, odnowić, przywrócić lub po pr...",NaN
2,http://warszawa.oglaszamy24.pl/ogloszenie/1017...,"Medycyna pracy od ręki ,badania wysokościowe,\...",NaN
3,http://lodz.oglaszamy24.pl/ogloszenie/49325871...,"Medycyna pracy od ręki ,badania wysokościowe,\...",NaN
4,http://katowice.oglaszamy24.pl/ogloszenie/1330...,"Medycyna pracy od ręki ,badania wysokościowe,\...",NaN

In [33]:
df_jh.head()

,text,label,id
0,"Poszukujemy osoby do obsługi klienta, która bę...",0,bfc53318-b3c0-4cea-812c-bb5376c62da3
1,"Poszukujemy Specjalisty ds. Obsługi Klienta, k...",0,cd5f1bb9-3690-421e-bbe9-123443f28ae7
2,Stanowisko: Specjalista ds. Obsługi Klienta -...,0,a14d2655-4f4b-4290-8762-769884ffeabf
3,Stanowisko: Specjalista ds. Obsługi Klienta -...,0,ce6a2f3b-2171-4b5a-bd0a-b6630ef89694
4,Stanowisko: Specjalista ds. Obsługi Klienta -...,0,5629dc29-f624-4fd9-99c2-f77b69fe99d5

In [34]:
df_jhg.head()

,text,label,id
0,Specjalista ds. Obsługi Klienta i Sprzedaży Pr...,1,0f6cb189-8a7b-4633-9dd6-6d8171d08e13
1,Samodzielna Księgowa Twój zakres obowiązków: ...,1,d61883d8-c3a8-43ab-a2a1-dd0a67b05e3a
2,Specjalista ds. Obsługi Klienta Twój zakres o...,1,7dae3b88-9774-4754-aba6-10308bab5118
3,Asystent ds. Marketingu Twój zakres obowiązk...,1,9cf42314-0ef7-453a-a444-184949c9eefb
4,Specjalista ds. Sprzedaży Twój zakres obowiąz...,1,89a0c567-a929-4fd0-8156-5b5dd1eea89f

In [35]:
df_all = pd.concat([df_fb, df_olx, df_o24, df_jh, df_jhg], ignore_index=True)
df_all.head()

                 id                                               text  label
0  1357999284721525  ‼️‼️4.000 - 6.000 zł za spisanie i zamknięcie ...    NaN
1  1512648315923287  WARSZAWA!\n\nPotrzebuję hostessy lub hosta! 🙂\...    NaN
2  1512730425915076  PRACA OD JUTRA\nZatrudnię pełnoletnie osoby do...    NaN
3  1512510969270355  W związku z dynamicznie rozwijającym się Zespo...    NaN
4  1505264493328336  Przy komputerze\nUmowa, wynagrodzenie co miesi...    NaN

In [36]:
df_all.shape

(3423, 3)

In [37]:
df_all['text'].nunique()

2905

In [38]:
df_all.dropna(subset=['text'], inplace=True)

In [39]:
df_all['text'] = df_all['text'].apply(lambda x: re.sub('[\W]+', ' ', x))

In [40]:
df_all['text'] = df_all['text'].apply(str.lower)

In [41]:
df_all.head()

                 id                                               text  label
0  1357999284721525   4 000 6 000 zł za spisanie i zamknięcie 1 umo...    NaN
1  1512648315923287  warszawa potrzebuję hostessy lub hosta 30 11 0...    NaN
2  1512730425915076  praca od jutra zatrudnię pełnoletnie osoby do ...    NaN
3  1512510969270355  w związku z dynamicznie rozwijającym się zespo...    NaN
4  1505264493328336  przy komputerze umowa wynagrodzenie co miesiąc...    NaN

In [42]:
df_all.to_csv('../data/all_cleaned_data.csv', index=False)
with open('../data/all_cleaned_data.json', 'w', encoding='utf-8') as f:
  df_all.to_json(f, force_ascii=False, orient='records')